In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={'Name':['Ramesh','Suresh','Sathish',np.nan],'Age':[30,33,np.nan,36],'City':[np.nan,'Hyd','Hyd','Blr']}

In [3]:
data=pd.DataFrame(dict1)

In [4]:
data

      Name   Age City
0   Ramesh  30.0  NaN
1   Suresh  33.0  Hyd
2  Sathish   NaN  Hyd
3      NaN  36.0  Blr

In [5]:
data.isnull()

    Name    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [6]:
data.isnull().sum()

Name    1
Age     1
City    1
dtype: int64

**dropna**

- drop the null values data based on rows and columns

In [7]:
# I want to extract the data without Null values
data.dropna()

     Name   Age City
1  Suresh  33.0  Hyd

In [8]:
data

      Name   Age City
0   Ramesh  30.0  NaN
1   Suresh  33.0  Hyd
2  Sathish   NaN  Hyd
3      NaN  36.0  Blr

In [9]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [10]:
dict1={'Name':['Ramesh','Suresh','Sathish',np.nan],
       'Age':[30,33,np.nan,36],
       'City':[np.nan,'Hyd','Hyd','Blr'],
       'Company':['Google','Microsoft','Apple','Meta']}

In [11]:
data=pd.DataFrame(dict1)

In [12]:
data

      Name   Age City    Company
0   Ramesh  30.0  NaN     Google
1   Suresh  33.0  Hyd  Microsoft
2  Sathish   NaN  Hyd      Apple
3      NaN  36.0  Blr       Meta

In [13]:
data.dropna(axis=1)

     Company
0     Google
1  Microsoft
2      Apple
3       Meta

**fillna**

- filling the data instead of droping

In [14]:
data.fillna(30)

      Name   Age City    Company
0   Ramesh  30.0   30     Google
1   Suresh  33.0  Hyd  Microsoft
2  Sathish  30.0  Hyd      Apple
3       30  36.0  Blr       Meta

In [15]:
data['Age'].fillna(30)

0    30.0
1    33.0
2    30.0
3    36.0
Name: Age, dtype: float64

In [16]:
data

      Name   Age City    Company
0   Ramesh  30.0  NaN     Google
1   Suresh  33.0  Hyd  Microsoft
2  Sathish   NaN  Hyd      Apple
3      NaN  36.0  Blr       Meta

In [17]:
data['Name'].fillna('mallesh')

0     Ramesh
1     Suresh
2    Sathish
3    mallesh
Name: Name, dtype: object

In [18]:
data['City'].fillna('blr')

0    blr
1    Hyd
2    Hyd
3    Blr
Name: City, dtype: object

- this method is not as good as it fills all the values with same vakue

- to avoid the we have Random values is not as good as approach
    - backfill
 
    - bfill
 
    - ffill
 
    - pad

In [ ]:
data.fillna()

In [21]:
data.bfill()

      Name   Age City    Company
0   Ramesh  30.0  Hyd     Google
1   Suresh  33.0  Hyd  Microsoft
2  Sathish  36.0  Hyd      Apple
3      NaN  36.0  Blr       Meta

In [29]:
data.pad()

      Name   Age City    Company
0   Ramesh  30.0  NaN     Google
1   Suresh  33.0  Hyd  Microsoft
2  Sathish  33.0  Hyd      Apple
3  Sathish  36.0  Blr       Meta

In [30]:
data.ffill()

      Name   Age City    Company
0   Ramesh  30.0  NaN     Google
1   Suresh  33.0  Hyd  Microsoft
2  Sathish  33.0  Hyd      Apple
3  Sathish  36.0  Blr       Meta

In [32]:
import warnings
warnings.filterwarnings('ignore')
data.backfill()

      Name   Age City    Company
0   Ramesh  30.0  Hyd     Google
1   Suresh  33.0  Hyd  Microsoft
2  Sathish  36.0  Hyd      Apple
3      NaN  36.0  Blr       Meta

In [34]:
data.pad(axis=1)

      Name      Age  City    Company
0   Ramesh     30.0  30.0     Google
1   Suresh     33.0   Hyd  Microsoft
2  Sathish  Sathish   Hyd      Apple
3      NaN     36.0   Blr       Meta

In [35]:
data.ffill(axis=1)

      Name      Age  City    Company
0   Ramesh     30.0  30.0     Google
1   Suresh     33.0   Hyd  Microsoft
2  Sathish  Sathish   Hyd      Apple
3      NaN     36.0   Blr       Meta

In [36]:
data.bfill(axis=1)

      Name   Age    City    Company
0   Ramesh  30.0  Google     Google
1   Suresh  33.0     Hyd  Microsoft
2  Sathish   Hyd     Hyd      Apple
3     36.0  36.0     Blr       Meta

In [37]:
data.bfill(axis=1
          )

      Name   Age    City    Company
0   Ramesh  30.0  Google     Google
1   Suresh  33.0     Hyd  Microsoft
2  Sathish   Hyd     Hyd      Apple
3     36.0  36.0     Blr       Meta

**Mean-Median-Mode**

In [38]:
age_mean=data['Age'].mean()
data.fillna(age_mean)

      Name   Age  City    Company
0   Ramesh  30.0  33.0     Google
1   Suresh  33.0   Hyd  Microsoft
2  Sathish  33.0   Hyd      Apple
3     33.0  36.0   Blr       Meta

In [39]:
data['Age'].fillna(data['Age'].mean())

0    30.0
1    33.0
2    33.0
3    36.0
Name: Age, dtype: float64

In [40]:
agemean=data['Age'].mean()
print('agemean:', agemean)
data['Age'].fillna(agemean)

agemean: 33.0

0    30.0
1    33.0
2    33.0
3    36.0
Name: Age, dtype: float64

In [41]:
data

      Name   Age City    Company
0   Ramesh  30.0  NaN     Google
1   Suresh  33.0  Hyd  Microsoft
2  Sathish   NaN  Hyd      Apple
3      NaN  36.0  Blr       Meta

In [42]:
data['City'].fillna(data['City'].mode())

0    Hyd
1    Hyd
2    Hyd
3    Blr
Name: City, dtype: object

In [43]:
data['Age'].fillna(data['Age'].median())

0    30.0
1    33.0
2    33.0
3    36.0
Name: Age, dtype: float64

In [45]:
data['City'].fillna(data['City'].mode())

0    Hyd
1    Hyd
2    Hyd
3    Blr
Name: City, dtype: object

In [47]:
city_mode=data['City'].mode()
city_mode.values[0]

'Hyd'

**KNN imputer**
preprocessing ke liye preprocessing
impute ke liye impute
- under sklearn we ahve impute class is there

In [50]:
from sklearn import impute

In [52]:
dir(impute)

['KNNImputer',
 'MissingIndicator',
 'SimpleImputer',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__getattr__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '_base',
 '_knn',
 'typing']

In [58]:
import numpy as np
from sklearn.impute import KNNImputer
X=[[1,2,np.nan],[3,np.nan,3],[np.nan,60,5],[8,8,7]]
imputer = KNNImputer(n_neighbors=2,weights='uniform')
imputer.fit_transform(X)

array([[ 1. ,  2. ,  5. ],
       [ 3. , 31. ,  3. ],
       [ 5.5, 60. ,  5. ],
       [ 8. ,  8. ,  7. ]])

In [56]:
import numpy as np
from sklearn.impute import KNNImputer
X=[[1,2,np.nan],[3,np.nan,3],[np.nan,60,5],[8,8,7]]
imputer = KNNImputer(n_neighbors=2,weights='distance')
imputer.fit_transform(X)

array([[ 1.        ,  2.        ,  3.93905505],
       [ 3.        , 31.        ,  3.        ],
       [ 3.25775362, 60.        ,  5.        ],
       [ 8.        ,  8.        ,  7.        ]])